{
  "fetchedAt": "2026-01-26T04:11:07.410Z",
  "articles": [
    {
      "slug": "using-nestr",
      "url": "https://help.nestr.io/en/using-nestr",
      "title": "Using Nestr",
      "category": "using-nestr",
      "content": "Using Nestr How to use the Nestr web app. Giving or requesting feedback in Nestr Upskill yourself and your peers using role based feedback Written by Joost Schouten Updated 1 year ago Automate your business processes with Nest With Nestr's Automations app you can pretty much automate anything Written by Joost Schouten Updated 1 year ago Private projects, meetings, todos and notes Transparency as the default, privacy when needed. Written by Joost Schouten Updated 1 year ago Nestr - The power of labels What are labels and how to use them Written by Joost Schouten Updated 1 year ago Chat & channels - communication in Nestr Circle based communication and private messaging in Nestr. Written by Joost Schouten Updated 1 year ago Navigating Nestr How Nestr is setup and how you can navigate it Written by Joost Schouten Updated 1 year ago Invited into a collaborative workspace? How to get started. You have been invited into Nestr by a colleague or friend. Let us run you through what Nestr is and how you can use it. Written by Joost Schouten Updated 1 year ago Setting up a new collaborative workspace Getting started with your collaborative Nestr workspace Written by Joost Schouten Updated 10 months ago Using Nestr - a quick overview Let us run you through the basic functionalities of Nestr Written by Joost Schouten Updated 1 year ago Work - Collaborating with your peers Managing the productivity in your organization with Nestr Written by Julio Holon Updated 1 year ago Structure and Governance - shared agreements in Nestr Setting up and updating your structure/governance in Nestr Written by Julio Holon Updated 1 year ago Getting started with Nestr What is Nestr all about and how to get started Written by Joost Schouten Updated 1 year ago Nestr - the basic building blocks Here we'll explain the building blocks and tools that make up Nestr. Written by Joost Schouten Updated 2 years ago Nestr search How to search and find things in Nestr Written by Joost Schouten Updated 1 year ago",
      "fetchedAt": "2026-01-26T04:10:46.736Z"
    },
    {
      "slug": "integrations",
      "url": "https://help.nestr.io/en/integrations",
      "title": "Integrations",
      "category": "integrations",
      "content": "Integrations How Nestr integrates with your other tools of choice Importing Data from Glassfrog Import your Glassfrog data into Nestr Written by Julio Holon Updated 10 months ago Importing and exporting your data with Nestr Written by Joost Schouten Updated 10 months ago Nestr SCIM user provisioning Automatically sync all your users from your existing systems with Nestr. Written by Joost Schouten Updated 1 year ago SAML authentication for Nestr Setup SAML authentication for your Nestr workspace Written by Joost Schouten Updated 1 year ago Importing Data from Holaspirit Import your data from Holaspirit into Nestr Written by Julio Holon Updated 10 months ago Nestr Discord integration How to use Nestr from Discord Written by Julio Holon Updated 2 years ago Linking your DAO to Nestr Learn how to integrate your DAO on Nestr workspaces Written by Julio Holon Updated 2 years ago Using the Nestr API For developers: A technical description on how to integrate with Nestr using our API Written by Joost Schouten Updated 1 year ago",
      "fetchedAt": "2026-01-26T04:10:47.656Z"
    },
    {
      "slug": "using-nestr/work-collaborating-with-your-collegues",
      "url": "https://help.nestr.io/en/using-nestr/work-collaborating-with-your-collegues",
      "title": "Work - Collaborating with your peers",
      "category": "using-nestr",
      "content": "Work - Collaborating with your peers Managing the productivity in your organization with Nestr Written by Julio Holon Updated 1 year ago The greatest advantage to having a clear organisational structure (agreements, circles and roles) in a single place is that it becomes even easier to give transparency on how everyone in the organisation is using this structure to do work. To get clarity on what Role is doing, Nestr has a simple Kanban board system where everyone can follow Projects organised by status and Tasks per Role and per person. The possible states of a project are: Current It's being worked on, with no external blockers Waiting It's blocked, waiting on some external factor Done It's concluded and done Future It's not being worked on right now Any project/todo may have a due date which will be displayed on the card and turn red when overdue. A project can have as many todo's under it as you need. You can even nest them and have todo's in todo's so you can make your projects as elaborate or simple as you need them to be. If you need to further specify what is needed to conclude the project, you can use Tasks and subtasks inside the project, that can be assigned to other people as well. And at the bottom of every project/todo you can capture/share any relevant information or ask any questions of your colleagues in the comments. Simply type @name_of_your_collegue to mention them and they will get notified of your question. Did this answer your question? The greatest advantage to having a clear organisational structure (agreements, circles and roles) in a single place is that it becomes even easier to give transparency on how everyone in the organisation is using this structure to do work. To get clarity on what Role is doing, Nestr has a simple Kanban board system where everyone can follow Projects organised by status and Tasks per Role and per person. The possible states of a project are: Current It's being worked on, with no external blockers Waiting It's blocked, waiting on some external factor Done It's concluded and done Future It's not being worked on right now Any project/todo may have a due date which will be displayed on the card and turn red when overdue. A project can have as many todo's under it as you need. You can even nest them and have todo's in todo's so you can make your projects as elaborate or simple as you need them to be. If you need to further specify what is needed to conclude the project, you can use Tasks and subtasks inside the project, that can be assigned to other people as well. And at the bottom of every project/todo you can capture/share any relevant information or ask any questions of your colleagues in the comments. Simply type @name_of_your_collegue to mention them and they will get notified of your question.",
      "fetchedAt": "2026-01-26T04:10:48.541Z"
    },
    {
      "slug": "integrations/nestr-scim-user-provisioning",
      "url": "https://help.nestr.io/en/integrations/nestr-scim-user-provisioning",
      "title": "Nestr SCIM user provisioning",
      "category": "integrations",
      "content": "Nestr SCIM user provisioning Automatically sync all your users from your existing systems with Nestr. Written by Joost Schouten Updated 1 year ago Chances are that you already have a central database with all your employees like Google Workspace, Microsoft Azure or an HR database. If this system supports SCIM (System for Cross-domain Identity Management) you can automatically add/remove uses from Nestr when you add remove them there. All you need to do is go to your workspace settings: There, if you have not already, go to 'User Permissions' and select 'Allow email users from certain domains to join this workspace' and enter all domains, comma separated, you use when provisioning users. Note that once added, we'll do a manual verification on our end to ensure claimed domains actually match the workspace. We'll email you once this is completed (usually within an hour). Once your domains are verified, enable the SCIM integration on your integrations page on your workspace settings: For the rest of this article we'll use Azure as the example SCIM provider but the basics are the same for other providers. In your Azure portal go to 'Enterprise applications' and click '+ New application' When creating an application click '+ Create your own application', give it a name (eg. Nestr.io) and choose the option 'Integrate any other application you don't find in the gallery (Non-gallery)'. When created assign the correct users and/or groups to your new Enterprise application and under 'Manage' to to 'provisioning'. Select 'Automatic' as the provisioning mode. Go back to Nestr and copy the SCIM API Url and paste it into the Tenant URL field under 'Admin Credentials'. Copy the API key from Nestr and paste it in the 'Secret Token' field. Click 'Test connection' to see if the configuration works. If it does, click 'Save'. On the same page, open the 'Mappings' segment and click 'Provision Microsoft Entra ID Users' There you can setup what information will be send across to Nestr. You can remove most fields and only leave the following mappings (note that userName may also be mapped to userPrincipalName). Click Save, close the settings window. Now click 'Start provisioning' and all your users will be added to Nestr. Any user added to the users configured for access to the Enterprise application in Azure, will automatically be added to Nestr and any user removed, will be removed from Nestr. Note that this provisioning setup seamlessly works with our Google, Microsoft and SAML login methods as well. Did this answer your question? Chances are that you already have a central database with all your employees like Google Workspace, Microsoft Azure or an HR database. If this system supports SCIM (System for Cross-domain Identity Management) you can automatically add/remove uses from Nestr when you add remove them there. All you need to do is go to your workspace settings: There, if you have not already, go to 'User Permissions' and select 'Allow email users from certain domains to join this workspace' and enter all domains, comma separated, you use when provisioning users. Note that once added, we'll do a manual verification on our end to ensure claimed domains actually match the workspace. We'll email you once this is completed (usually within an hour). Once your domains are verified, enable the SCIM integration on your integrations page on your workspace settings: For the rest of this article we'll use Azure as the example SCIM provider but the basics are the same for other providers. In your Azure portal go to 'Enterprise applications' and click '+ New application' When creating an application click '+ Create your own application', give it a name (eg. Nestr.io) and choose the option 'Integrate any other application you don't find in the gallery (Non-gallery)'. When created assign the correct users and/or groups to your new Enterprise application and under 'Manage' to to 'provisioning'. Select 'Automatic' as the provisioning mode. Go back to Nestr and copy the SCIM API Url and paste it into the Tenant URL field under 'Admin Credentials'. Copy the API key from Nestr and paste it in the 'Secret Token' field. Click 'Test connection' to see if the configuration works. If it does, click 'Save'. On the same page, open the 'Mappings' segment and click 'Provision Microsoft Entra ID Users' There you can setup what information will be send across to Nestr. You can remove most fields and only leave the following mappings (note that userName may also be mapped to userPrincipalName). Click Save, close the settings window. Now click 'Start provisioning' and all your users will be added to Nestr. Any user added to the users configured for access to the Enterprise application in Azure, will automatically be added to Nestr and any user removed, will be removed from Nestr. Note that this provisioning setup seamlessly works with our Google, Microsoft and SAML login methods as well.",
      "fetchedAt": "2026-01-26T04:10:49.423Z"
    },
    {
      "slug": "using-nestr/giving-or-requesting-feedback-in-nestr",
      "url": "https://help.nestr.io/en/using-nestr/giving-or-requesting-feedback-in-nestr",
      "title": "Giving or requesting feedback in Nestr",
      "category": "using-nestr",
      "content": "Giving or requesting feedback in Nestr Upskill yourself and your peers using role based feedback Written by Joost Schouten Updated 1 year ago If you are a member of a workspace where the feedback app is enabled, you can give your peers feedback or request them to give you feedback. Feedback is crucial in any organisation and specifically in a selforganized or role based organization as there is less centralized control or management, relying on your peers becomes more important. This document assumes your workspace administrator has already setup the feedback app within nestr for you. If you can't see the options highlighted here, ask them to enable them for you. Giving feedback to your peers There are a few ways to initiate feedback. 1) From \"My feedback\", click on \"Give feedback\" 2) From your circle's \"Work\" page under the \"feedback\" tab 3) Hover over your collegues profile picture anywhere within Nestr and select \"Give feedback\" from the context window. When you click give feedback, the feedback pop-up will show where you can select the user and role to give feedback to (if you used option three to initiate the feedback, these will be pre-filled with the user you selected). Here you can search for either a user or a role to give feedback to. It depends on how your organisation uses feedback if you will choose user or role feedback. We do advice role feedback in most cases as it will allow you to give specific and actionable feedback for one specific role at a time. A person might be great in their \"Marketing role\" and might need to grow in their \"Facilitator\" role. Once you selected the user and their optional role, click next to give the actual feedback. If your organisation has setup multiple feedback forms to use, you will need to choose the type of feedback here too. The specifics of the feedback forms is fully customizable per workspace. Here is an example of a simple Keep/Stop/Start feedback form. Note that when giving feedback to a user in a role, you can toggle the role open and closed by clicking on the name of the role in the header to help remind you what can be expected from your colleague in that specific role. When you are ready, you can click \"Give feedback\" which will notify your colleague that you have given them feedback. Optionally if you are not quite ready yet, you may \"Save for later\" so you can continue and submit at a later time. Receiving feedback Once the feedback is given, the receiver will get an email and an in-app notification that they have new feedback to review. You can also find this on your \"My feedback\" page. New feedback shows at the top under \"My feedback to process\" Click the view button to open it. Here you can see who gave you feedback, to what role and the actual feedback. Take a moment to absorb the feedback and identify next steps to help you integrate the learnings provided by your peers. As a feedback receiver, you can choose to add the feedback to your profile privately or publically. When private, only you and the feedback provider can see it. When made public, everyone within your workspace can see the feedback given. Only the receiver can change this setting to ensure sensitive feedback can be integrated in a way that feels save to the receiver. All your given, received and pending feedback can be found on \"My feedback\" as well as in the circles where it was received/given. Requesting feedback Requesting feedback works the same as giving feedback accept that the receiver initiates it. Just like giving feedback it can be started from your My feedback page, from the circle feedback page or by hovering over any profile picture of a user you wish to request feedback from. When you have selected one of your roles to request feedback on (or no role), you can add multiple people to request it from and give some context on the feedback you are after to help frame your request. They will receive the request in an email and in app notification to give you the feedback you are after. Did this answer your question? If you are a member of a workspace where the feedback app is enabled, you can give your peers feedback or request them to give you feedback. Feedback is crucial in any organisation and specifically in a selforganized or role based organization as there is less centralized control or management, relying on your peers becomes more important. This document assumes your workspace administrator has already setup the feedback app within nestr for you. If you can't see the options highlighted here, ask them to enable them for you. Giving feedback to your peers There are a few ways to initiate feedback. 1) From \"My feedback\", click on \"Give feedback\" 2) From your circle's \"Work\" page under the \"feedback\" tab 3) Hover over your collegues profile picture anywhere within Nestr and select \"Give feedback\" from the context window. When you click give feedback, the feedback pop-up will show where you can select the user and role to give feedback to (if you used option three to initiate the feedback, these will be pre-filled with the user you selected). Here you can search for either a user or a role to give feedback to. It depends on how your organisation uses feedback if you will choose user or role feedback. We do advice role feedback in most cases as it will allow you to give specific and actionable feedback for one specific role at a time. A person might be great in their \"Marketing role\" and might need to grow in their \"Facilitator\" role. Once you selected the user and their optional role, click next to give the actual feedback. If your organisation has setup multiple feedback forms to use, you will need to choose the type of feedback here too. The specifics of the feedback forms is fully customizable per workspace. Here is an example of a simple Keep/Stop/Start feedback form. Note that when giving feedback to a user in a role, you can toggle the role open and closed by clicking on the name of the role in the header to help remind you what can be expected from your colleague in that specific role. When you are ready, you can click \"Give feedback\" which will notify your colleague that you have given them feedback. Optionally if you are not quite ready yet, you may \"Save for later\" so you can continue and submit at a later time. Receiving feedback Once the feedback is given, the receiver will get an email and an in-app notification that they have new feedback to review. You can also find this on your \"My feedback\" page. New feedback shows at the top under \"My feedback to process\" Click the view button to open it. Here you can see who gave you feedback, to what role and the actual feedback. Take a moment to absorb the feedback and identify next steps to help you integrate the learnings provided by your peers. As a feedback receiver, you can choose to add the feedback to your profile privately or publically. When private, only you and the feedback provider can see it. When made public, everyone within your workspace can see the feedback given. Only the receiver can change this setting to ensure sensitive feedback can be integrated in a way that feels save to the receiver. All your given, received and pending feedback can be found on \"My feedback\" as well as in the circles where it was received/given. Requesting feedback Requesting feedback works the same as giving feedback accept that the receiver initiates it. Just like giving feedback it can be started from your My feedback page, from the circle feedback page or by hovering over any profile picture of a user you wish to request feedback from. When you have selected one of your roles to request feedback on (or no role), you can add multiple people to request it from and give some context on the feedback you are after to help frame your request. They will receive the request in an email and in app notification to give you the feedback you are after.",
      "fetchedAt": "2026-01-26T04:10:50.288Z"
    },
    {
      "slug": "using-nestr/structure-and-governance-in-nestr",
      "url": "https://help.nestr.io/en/using-nestr/structure-and-governance-in-nestr",
      "title": "Structure and Governance - shared agreements in Nestr",
      "category": "using-nestr",
      "content": "Structure and Governance - shared agreements in Nestr Setting up and updating your structure/governance in Nestr Written by Julio Holon Updated 1 year ago The basics of governance in Nestr Nestr aims to support you in manifesting your purpose using self-organisation. This means you will no longer rely on a management hierarchy to make decisions but will have some form of explicit agreements on how decisions are made. Nestr support many different ways of setting this up. So weather you use Sociocracy, Holacracy, Teal practices or some other form of role based work, Nestr supports it. And across these different ways to self-organise, there are some common practices. In all cases, you'll use roles and circles to express how accountability is distributed throughout your organisation.Every role/circle will be made up of: Name Best to use something that is easy to remember. e.g.: \"Blogger\" Purpose A phrase that inspires whoever is assigned to that Role to know what is expected in the broadest scope. e.g.: \"An blog that amuses readers with inspiring content\" Accountabilities A list of ongoing activities that the person on that Role is expected to be doing from time to time. e.g.: \"Writing posts to the blog\" Domains Domains where that Role has exclusive control and possibly, policies to access that domains. If another Role needs access they can ask the domain owning Role to impact it. Or perhaps the owning role has published a policy on how to impact the domain. Ex.: \"Blog admin functions\" when you enable self-organization in nestr, we'll automatically add some common core roles to each circle you create. We'll follow accepted definitions of these core roles dependent on the type of self-organisation you have selected for your workspace. In most cases they will look something like this: Circle Lead Generally represents the initiative starter or someone appointed to lead the strategy of the circle. Whoever is on this Role is responsible for structuring the circle and inviting new members into other Roles. Usually appointed from the outer circle. Facilitator Facilitates regular circle meeting and can also give coaching and support on self-organization. This role is usually elected. Secretary Focused on giving clarity on the agreements and organizational structure, also registers the circle meeting outcomes (like new projects, roles etc.). It's usually an elected role. Rep Link Represents the circle members and needs on external circle meetings. This is usually and elected role. You can configure which roles to use in your workspace settings and can even add custom roles if the default setup does not serve your needs. Proposing changes to governance Any circle member in Nestr can propose changes to the structure/governance of your organisation. This is one of the core principles of self-organisation. In Nestr is it quite simple to propose a change to any role, circle or policy. Under the '+ create' button on the left top of the page click 'Agenda item'. Give your agenda item a short name Select the circle this agenda item applies to and tick the 'Governance tension' option. Click 'create agenda item' - This will open the agenda item in the detail view on the right. There you will be able to select what you would like to propose. Create a new role or circle Edit an existing role or circle Create a new policy Edit an existing policy Hold an election for an electable role The proposal page has a few parts to it: On the left you will see all open agenda items for the circle including the one you are editing showing up as selected. On the right in your new proposal you can describe your proposal and the underlying tension. You can remove proposal parts and see the changes you have introduced in the proposal. Click the document icon and we'll only show the changes made. Add as many parts to your proposal as you need though it is advisable to have a few smaller proposals over one big one. You can save the proposal to bring to the next governance meeting. Or you can propose the proposal asynchronously. This will email all circle members about your proposal and give them a chance to object to or accept your proposal. You can also process any questions and comments right in the proposal iteslf using the comments section at the bottom. Did this answer your question? The basics of governance in Nestr Nestr aims to support you in manifesting your purpose using self-organisation. This means you will no longer rely on a management hierarchy to make decisions but will have some form of explicit agreements on how decisions are made. Nestr support many different ways of setting this up. So weather you use Sociocracy, Holacracy, Teal practices or some other form of role based work, Nestr supports it. And across these different ways to self-organise, there are some common practices. In all cases, you'll use roles and circles to express how accountability is distributed throughout your organisation.Every role/circle will be made up of: Name Best to use something that is easy to remember. e.g.: \"Blogger\" Purpose A phrase that inspires whoever is assigned to that Role to know what is expected in the broadest scope. e.g.: \"An blog that amuses readers with inspiring content\" Accountabilities A list of ongoing activities that the person on that Role is expected to be doing from time to time. e.g.: \"Writing posts to the blog\" Domains Domains where that Role has exclusive control and possibly, policies to access that domains. If another Role needs access they can ask the domain owning Role to impact it. Or perhaps the owning role has published a policy on how to impact the domain. Ex.: \"Blog admin functions\" when you enable self-organization in nestr, we'll automatically add some common core roles to each circle you create. We'll follow accepted definitions of these core roles dependent on the type of self-organisation you have selected for your workspace. In most cases they will look something like this: Circle Lead Generally represents the initiative starter or someone appointed to lead the strategy of the circle. Whoever is on this Role is responsible for structuring the circle and inviting new members into other Roles. Usually appointed from the outer circle. Facilitator Facilitates regular circle meeting and can also give coaching and support on self-organization. This role is usually elected. Secretary Focused on giving clarity on the agreements and organizational structure, also registers the circle meeting outcomes (like new projects, roles etc.). It's usually an elected role. Rep Link Represents the circle members and needs on external circle meetings. This is usually and elected role. You can configure which roles to use in your workspace settings and can even add custom roles if the default setup does not serve your needs. Proposing changes to governance Any circle member in Nestr can propose changes to the structure/governance of your organisation. This is one of the core principles of self-organisation. In Nestr is it quite simple to propose a change to any role, circle or policy. Under the '+ create' button on the left top of the page click 'Agenda item'. Give your agenda item a short name Select the circle this agenda item applies to and tick the 'Governance tension' option. Click 'create agenda item' - This will open the agenda item in the detail view on the right. There you will be able to select what you would like to propose. Create a new role or circle Edit an existing role or circle Create a new policy Edit an existing policy Hold an election for an electable role The proposal page has a few parts to it: On the left you will see all open agenda items for the circle including the one you are editing showing up as selected. On the right in your new proposal you can describe your proposal and the underlying tension. You can remove proposal parts and see the changes you have introduced in the proposal. Click the document icon and we'll only show the changes made. Add as many parts to your proposal as you need though it is advisable to have a few smaller proposals over one big one. You can save the proposal to bring to the next governance meeting. Or you can propose the proposal asynchronously. This will email all circle members about your proposal and give them a chance to object to or accept your proposal. You can also process any questions and comments right in the proposal iteslf using the comments section at the bottom.",
      "fetchedAt": "2026-01-26T04:10:51.171Z"
    },
    {
      "slug": "using-nestr/automate-your-business-processes-with-nest",
      "url": "https://help.nestr.io/en/using-nestr/automate-your-business-processes-with-nest",
      "title": "Automate your business processes with Nest",
      "category": "using-nestr",
      "content": "Automate your business processes with Nest With Nestr's Automations app you can pretty much automate anything Written by Joost Schouten Updated 1 year ago One mantra we try to live by at Nestr is that we don't pretend to know how to best run your organisation. We are here to support any and all experimentation in persuit of your organisational purpose. In that light, we offer our Automations app. It allows you to automate many different business processes relieving you of the manual work. Here are a few examples on how you can use it: Support new members of your organisation through an automated onboarding flow. Invite everyone in your organisation (or a business unit/circle) to your queartery feedback cycle. Configure a training where people are taken through a course for x weeks/months. Trigger your configured AI bot to assist a team when they start a new meeting. Create a set of todo's for a user when they are assigned to a new role. Whatever else you can come up with... How to set it up At current, only workspace admins can configure automations. You can enable it on 'Applications' tab of your workspace. Once enabled, you can create new automations to your workspace. You will see the following screen to start with Let's run trough the automation options: Status: Is the automation enabled or not? Default this is set to draft. When you are ready, you can set this to active. You can pause an automation at any time. Target: What will be targeted by this automation? Workspace (default): Target the entire workspace. Specific item: This will allow you to target a single circle, project, todo or anything you have defined in your workspace. All items with specific label: This allows you, for example, to target all circles or roles in your workspace, or all projects with a specific label. Trigger: What will trigger the automation to run? Manual trigger (default): , meaning you can start it yourself by clicking a button. Date/time: Start the trigger at a specified time with optionally re-runs at a specified interval. User assign: Run the automation when a user is assigned to the target. When the target is 'Workspace' it means a new member in the workspace. When the target is a specific item or a certain labled item, it means when a user is assigned to such an item. Created: This is only available when the target is 'All items with specific label' and will trigger when such an item is created. Event started: This is only available when the target is 'All items with specific label' and will trigger when an event starts. This is specifically useful for meetings that are scheduled to start at a certain time. If this trigger is applied to an event that does not have a start date/time, it will trigger at creation. Audience: Will this automation have an audinece or not? Assignees (default): This automation will target all assignees of the target. No audience: This automation will not have an audience. This is usefull when your automation is not meant to interact with users. For example when you want to create a set of todo's in a project when labeled with a certain label. Reruns: How often should this automation be re-run? Unlimited: This automation may be rerun as often as it is triggered. (eg. Your quesrtely feedback invitation flow) Once per target: This automation should only run once per target. (eg. Adding a set to todo's to a project) Once per user: This automation should only run once per user. (eg. An onboarding flow into the organisation) Once per target/user: This automation should only run once per target user combination. (eg. An onboarding flow into a new role) Define what the Automation should do Once you have configured what the automation will target, how it is triggered and who the audience is, you can define what it should do in the 'Steps' section. Click the '+ Add an automation step', give teh step an initial name and hit enter. When you created your first step, click on it to open it. There you will have one drop down to set the step action with the following options: Wait: Wait for a certain amount of time from the moment the step is triggered. This can be used at the start of your automation or between steps. Usefull for example when you setup an onboarding flow where you want to email a user every week for 6 weeks. Email: Email your audience. Here you can set the subject and content of your email. In both the content and the subject you may use template variables which Nestr will change at runtime. An example is {{audienceName}} which will use the name of the user you are emailing. A full list of template options is available below. Note that we will only email users with verified email addresses or users with an emailaddress on a verified domain that has been associated with your workspace. Post: Post a message in the Nestr feed of the target. If the target is a circle, it will add a message to the feed of that circle. If the target is a project, it will add a comment to that project. You may choose to mention your audience which will add a mention of your audience in the post notifying them of the post. You can also optionally make the post private to only those that are mentioned. In a post you can also use the target template variables but not the audience template variables as we'll only make one post per run which might have more than one user. Create item (coming soon): Create a new item in your target. For example, create a set of projects for any new role created or a todo when a certain label is added to a project. Available template options When sending out an email, posting a message or creating new items, you may use the following template variables. Nestr will replace these before emailing, posting or creating. {{targetTitle}}: The title of the target. eg. the name of the workspace, circle or project. {{targetUrl}}: The url of the target. When the target is a circle, these template options are available as well: {{targetAboutUrl}}: Url to the circle overview tab {{targetRolesUrl}}: Url to the circle roles page {{targetFeedUrl}}: Url to the circle feed {{targetFeedbackUrl}}: Url to the circle feedback page (if the feedback app is enabled) {{targetGoalsUrl}}: Url to the circle OKR page (if the OKR app is enabled) {{targetMeetingsUrl}}: Url to the circle meetings page {{targetProjectsUrl}}: Url to the circle projects page {{targetTodosUrl}}: Url to the circle todos page When your automation has a target, the follwoign template options are available as well. {{audienceName}}: The first name of the user {{audienceFullName}}: The full name of the user {{audienceEmail}}: The email of the user {{audienceProfileUrl}}: The url to the users profile page. {{audienceAccountSettingsUrl}}: The url to the users account settings page. {{audienceAccountNotificationSettingsUrl}}: The url to the users notifications settings page. {{audienceRolesUrl}}: The url to the users public roles page. {{audienceFeedbackUrl}}: The url to the users feedback page. For the user themselves, where they see all feedback and can request/give feedback. For others, where all feedback that is workspace public can be reviewed. When you tie it alltogether, a fully configured automation could look something like this: Did this answer your question? One mantra we try to live by at Nestr is that we don't pretend to know how to best run your organisation. We are here to support any and all experimentation in persuit of your organisational purpose. In that light, we offer our Automations app. It allows you to automate many different business processes relieving you of the manual work. Here are a few examples on how you can use it: Support new members of your organisation through an automated onboarding flow. Invite everyone in your organisation (or a business unit/circle) to your queartery feedback cycle. Configure a training where people are taken through a course for x weeks/months. Trigger your configured AI bot to assist a team when they start a new meeting. Create a set of todo's for a user when they are assigned to a new role. Whatever else you can come up with... How to set it up At current, only workspace admins can configure automations. You can enable it on 'Applications' tab of your workspace. Once enabled, you can create new automations to your workspace. You will see the following screen to start with Let's run trough the automation options: Status: Is the automation enabled or not? Default this is set to draft. When you are ready, you can set this to active. You can pause an automation at any time. Target: What will be targeted by this automation? Workspace (default): Target the entire workspace. Specific item: This will allow you to target a single circle, project, todo or anything you have defined in your workspace. All items with specific label: This allows you, for example, to target all circles or roles in your workspace, or all projects with a specific label. Trigger: What will trigger the automation to run? Manual trigger (default): , meaning you can start it yourself by clicking a button. Date/time: Start the trigger at a specified time with optionally re-runs at a specified interval. User assign: Run the automation when a user is assigned to the target. When the target is 'Workspace' it means a new member in the workspace. When the target is a specific item or a certain labled item, it means when a user is assigned to such an item. Created: This is only available when the target is 'All items with specific label' and will trigger when such an item is created. Event started: This is only available when the target is 'All items with specific label' and will trigger when an event starts. This is specifically useful for meetings that are scheduled to start at a certain time. If this trigger is applied to an event that does not have a start date/time, it will trigger at creation. Audience: Will this automation have an audinece or not? Assignees (default): This automation will target all assignees of the target. No audience: This automation will not have an audience. This is usefull when your automation is not meant to interact with users. For example when you want to create a set of todo's in a project when labeled with a certain label. Reruns: How often should this automation be re-run? Unlimited: This automation may be rerun as often as it is triggered. (eg. Your quesrtely feedback invitation flow) Once per target: This automation should only run once per target. (eg. Adding a set to todo's to a project) Once per user: This automation should only run once per user. (eg. An onboarding flow into the organisation) Once per target/user: This automation should only run once per target user combination. (eg. An onboarding flow into a new role) Define what the Automation should do Once you have configured what the automation will target, how it is triggered and who the audience is, you can define what it should do in the 'Steps' section. Click the '+ Add an automation step', give teh step an initial name and hit enter. When you created your first step, click on it to open it. There you will have one drop down to set the step action with the following options: Wait: Wait for a certain amount of time from the moment the step is triggered. This can be used at the start of your automation or between steps. Usefull for example when you setup an onboarding flow where you want to email a user every week for 6 weeks. Email: Email your audience. Here you can set the subject and content of your email. In both the content and the subject you may use template variables which Nestr will change at runtime. An example is {{audienceName}} which will use the name of the user you are emailing. A full list of template options is available below. Note that we will only email users with verified email addresses or users with an emailaddress on a verified domain that has been associated with your workspace. Post: Post a message in the Nestr feed of the target. If the target is a circle, it will add a message to the feed of that circle. If the target is a project, it will add a comment to that project. You may choose to mention your audience which will add a mention of your audience in the post notifying them of the post. You can also optionally make the post private to only those that are mentioned. In a post you can also use the target template variables but not the audience template variables as we'll only make one post per run which might have more than one user. Create item (coming soon): Create a new item in your target. For example, create a set of projects for any new role created or a todo when a certain label is added to a project. Available template options When sending out an email, posting a message or creating new items, you may use the following template variables. Nestr will replace these before emailing, posting or creating. {{targetTitle}}: The title of the target. eg. the name of the workspace, circle or project. {{targetUrl}}: The url of the target. When the target is a circle, these template options are available as well: {{targetAboutUrl}}: Url to the circle overview tab {{targetRolesUrl}}: Url to the circle roles page {{targetFeedUrl}}: Url to the circle feed {{targetFeedbackUrl}}: Url to the circle feedback page (if the feedback app is enabled) {{targetGoalsUrl}}: Url to the circle OKR page (if the OKR app is enabled) {{targetMeetingsUrl}}: Url to the circle meetings page {{targetProjectsUrl}}: Url to the circle projects page {{targetTodosUrl}}: Url to the circle todos page When your automation has a target, the follwoign template options are available as well. {{audienceName}}: The first name of the user {{audienceFullName}}: The full name of the user {{audienceEmail}}: The email of the user {{audienceProfileUrl}}: The url to the users profile page. {{audienceAccountSettingsUrl}}: The url to the users account settings page. {{audienceAccountNotificationSettingsUrl}}: The url to the users notifications settings page. {{audienceRolesUrl}}: The url to the users public roles page. {{audienceFeedbackUrl}}: The url to the users feedback page. For the user themselves, where they see all feedback and can request/give feedback. For others, where all feedback that is workspace public can be reviewed. When you tie it alltogether, a fully configured automation could look something like this:",
      "fetchedAt": "2026-01-26T04:10:52.059Z"
    },
    {
      "slug": "using-nestr/setting-up-a-new-collaborative-workspace",
      "url": "https://help.nestr.io/en/using-nestr/setting-up-a-new-collaborative-workspace",
      "title": "Setting up a new collaborative workspace",
      "category": "using-nestr",
      "content": "Setting up a new collaborative workspace Getting started with your collaborative Nestr workspace Written by Joost Schouten Updated 10 months ago Great, you have signed up for Nestr and are ready to test it out. The fact you are hear probably means you care about purpose driven work and self-organisation. There are many ways to self-organise and Nestr aims to support any and all experimentation around self-organisation. And since we don't pretent to know what the best way to self-organise is, we try to offer you a product that can adapt to your needs. In this article I will lay out how you can configure Nestr to serve you as best as we can. Creating a workspace First, go ahead and setup a new workspace. Click the 'Add workspace' button on your hoe screen of click the '+ create -> workspace'. This will open the new workspace wizard. The first step in the wizard asks you if this is a personal or collaborative workspace. We are assuming you are setting up a collaborative workspace for now and will explain how to setup a personal workspace elsewhere. The second step in the wizard aks about your governance model. You can choose between General self organisation, Sociocracy or Holacracy. If the later two are unfamiliar to you, simply choose 'General self organisation'. In the background this will pre-configure your workspace for you. The third step in the wizard asks if you want Nestr to use AI to generate a starting structure of roles and circles for you or if you want to create these yourself manually. The last step asks you for the name, logo and purpose of your organisation. You may leave the logo and purpose empty and in the case of AI we'll attempt to autofill these for you. Your worksapce is now created and ready for you to use. Here is an example of a non AI created workspace right after creation. Three core roles are created based on your governance method of choice. In the top right of the new workspace you will find a settings icon. Click it to further configure your workspace. There you will find the following pages: Users: Invite your colleagues into this workspace to join you in your organisation. Workspace details: Update the name, purpose, logo of your workspace. Workspace plan & billing: Choose your plan and provide your billing details for your paid workspace. User Permissions: Setup how access rights are organised in this workspace and optionally add domain names you own allowing people signing up using an email on those domains to automatically join your worksapce. Workspace labels: Configure what labels are available in your workspace. This is very flexible and allows you to categorize your roles, circles and projects in any way you choose. Applications: What applications are available in this workspace. This will allow you to turn them on/off and configure them. (see screenshot below) Integrations: Which other tools and products do you want Nestr to integrate with? You can setup an ever growing list of integrations. Importing data from other systems If your are currently using another tool for your self-organisation, you can import that data into Nestr. Here is an article on how to do that for tools like Holaspirit, Glassfrog and others. Nest steps Now that your workspace is created, you can start using it. Here are a few articles that lay out the basics of using Nestr: Navigating Nestr - Understanding the different elements in Nestr Structure/Governance - creating and updating your shared agreements Work - self-organised collaboration with your peers Communicate - communicating with your peers using Nestr Search - Search for and finding things in Nestr The building blocks of Nestr - How Nestr works so you can configure it to serve your needs Did this answer your question? Great, you have signed up for Nestr and are ready to test it out. The fact you are hear probably means you care about purpose driven work and self-organisation. There are many ways to self-organise and Nestr aims to support any and all experimentation around self-organisation. And since we don't pretent to know what the best way to self-organise is, we try to offer you a product that can adapt to your needs. In this article I will lay out how you can configure Nestr to serve you as best as we can. Creating a workspace First, go ahead and setup a new workspace. Click the 'Add workspace' button on your hoe screen of click the '+ create -> workspace'. This will open the new workspace wizard. The first step in the wizard asks you if this is a personal or collaborative workspace. We are assuming you are setting up a collaborative workspace for now and will explain how to setup a personal workspace elsewhere. The second step in the wizard aks about your governance model. You can choose between General self organisation, Sociocracy or Holacracy. If the later two are unfamiliar to you, simply choose 'General self organisation'. In the background this will pre-configure your workspace for you. The third step in the wizard asks if you want Nestr to use AI to generate a starting structure of roles and circles for you or if you want to create these yourself manually. The last step asks you for the name, logo and purpose of your organisation. You may leave the logo and purpose empty and in the case of AI we'll attempt to autofill these for you. Your worksapce is now created and ready for you to use. Here is an example of a non AI created workspace right after creation. Three core roles are created based on your governance method of choice. In the top right of the new workspace you will find a settings icon. Click it to further configure your workspace. There you will find the following pages: Users: Invite your colleagues into this workspace to join you in your organisation. Workspace details: Update the name, purpose, logo of your workspace. Workspace plan & billing: Choose your plan and provide your billing details for your paid workspace. User Permissions: Setup how access rights are organised in this workspace and optionally add domain names you own allowing people signing up using an email on those domains to automatically join your worksapce. Workspace labels: Configure what labels are available in your workspace. This is very flexible and allows you to categorize your roles, circles and projects in any way you choose. Applications: What applications are available in this workspace. This will allow you to turn them on/off and configure them. (see screenshot below) Integrations: Which other tools and products do you want Nestr to integrate with? You can setup an ever growing list of integrations. Importing data from other systems If your are currently using another tool for your self-organisation, you can import that data into Nestr. Here is an article on how to do that for tools like Holaspirit, Glassfrog and others. Nest steps Now that your workspace is created, you can start using it. Here are a few articles that lay out the basics of using Nestr: Navigating Nestr - Understanding the different elements in Nestr Structure/Governance - creating and updating your shared agreements Work - self-organised collaboration with your peers Communicate - communicating with your peers using Nestr Search - Search for and finding things in Nestr The building blocks of Nestr - How Nestr works so you can configure it to serve your needs",
      "fetchedAt": "2026-01-26T04:10:52.962Z"
    },
    {
      "slug": "integrations/linking-your-dao-to-nestr",
      "url": "https://help.nestr.io/en/integrations/linking-your-dao-to-nestr",
      "title": "Linking your DAO to Nestr",
      "category": "integrations",
      "content": "Linking your DAO to Nestr Learn how to integrate your DAO on Nestr workspaces Written by Julio Holon Updated 2 years ago One of the coolest new features of Nestr allows Decentralized Autonomous Organizations to link their existing DAO software to a Workspace, so you can track the DAO Proposals and use all the power of Nestr to manage them, like bind them to Projects, Tasks Circles or Roles, allowing one to track where the funds are being used and their status more clearly. For now the types of DAO currently supported are: Aragon, DAOHaus and HyphaDHO. You can start by creating a new Workspace, and selecting DAO: If you already have an existing workspace you wish to integrate with your DAO, you will need to enable the DAO app by going to your workspace settings page by clicking the settings icon on the right top of your workspace. On the workspace settings page go to the 'Applications' tab and enable the DAO app. Then, after finishing the Workspace wizard or enabling the DAO app, your workspace is ready for DAO integration. Next step is adding the DAO type, network and address, on the About tab: For ethereum based DAOs (Aragon, DAOHaus) you can use the 0x based DAO contract address, for Hypha DHO you should use the 12 character DAO account shortname that is usually on the DAO URL address (it should be listed here). After a few minutes, the DAO scrapper will scan the existing DAO proposals and show them on the Proposals tab: If you click on a Proposal you can see all blockchain details for them, like requested tokens, assignee, number of votes, etc. And you can also click the link the visit the original proposal on the DAO: Now you can click on any Proposal and move them inside an existing Role or Project, like this: Then your proposal will show like this: You can also see the proposal attached to the Project if you click inside it: This allows you to track the usage of the DAO resources tied to a Project or Role, to give more clarity and accountability! Did this answer your question? One of the coolest new features of Nestr allows Decentralized Autonomous Organizations to link their existing DAO software to a Workspace, so you can track the DAO Proposals and use all the power of Nestr to manage them, like bind them to Projects, Tasks Circles or Roles, allowing one to track where the funds are being used and their status more clearly. For now the types of DAO currently supported are: Aragon, DAOHaus and HyphaDHO. You can start by creating a new Workspace, and selecting DAO: If you already have an existing workspace you wish to integrate with your DAO, you will need to enable the DAO app by going to your workspace settings page by clicking the settings icon on the right top of your workspace. On the workspace settings page go to the 'Applications' tab and enable the DAO app. Then, after finishing the Workspace wizard or enabling the DAO app, your workspace is ready for DAO integration. Next step is adding the DAO type, network and address, on the About tab: For ethereum based DAOs (Aragon, DAOHaus) you can use the 0x based DAO contract address, for Hypha DHO you should use the 12 character DAO account shortname that is usually on the DAO URL address (it should be listed here). After a few minutes, the DAO scrapper will scan the existing DAO proposals and show them on the Proposals tab: If you click on a Proposal you can see all blockchain details for them, like requested tokens, assignee, number of votes, etc. And you can also click the link the visit the original proposal on the DAO: Now you can click on any Proposal and move them inside an existing Role or Project, like this: Then your proposal will show like this: You can also see the proposal attached to the Project if you click inside it: This allows you to track the usage of the DAO resources tied to a Project or Role, to give more clarity and accountability!",
      "fetchedAt": "2026-01-26T04:10:53.877Z"
    },
    {
      "slug": "using-nestr/private-projects-meetings-or-anything-else",
      "url": "https://help.nestr.io/en/using-nestr/private-projects-meetings-or-anything-else",
      "title": "Private projects, meetings, todos and notes",
      "category": "using-nestr",
      "content": "Private projects, meetings, todos and notes Transparency as the default, privacy when needed. Written by Joost Schouten Updated 1 year ago Though transparency is an important part of self-organisation, at times rules and regulations or personal privacy require information only to be shared with just a few roles or people. In these cases Nestr offers you a way to make pretty much anything private. You can choose who to share it with. As soon as you are assigned to a project, todo, meeting or note, you can make it private. Simply click the three dots on the item you wish to make private and click 'Make private'. It will make that item and any items and conversations under it private and visible to only those assigned. All private items will have a light yellow background color so you always know what is private and what is not. This private setting can be applied to meetings, agenda items, projects, notes, todo's, boards and everything that is not governance. Did this answer your question? Though transparency is an important part of self-organisation, at times rules and regulations or personal privacy require information only to be shared with just a few roles or people. In these cases Nestr offers you a way to make pretty much anything private. You can choose who to share it with. As soon as you are assigned to a project, todo, meeting or note, you can make it private. Simply click the three dots on the item you wish to make private and click 'Make private'. It will make that item and any items and conversations under it private and visible to only those assigned. All private items will have a light yellow background color so you always know what is private and what is not. This private setting can be applied to meetings, agenda items, projects, notes, todo's, boards and everything that is not governance.",
      "fetchedAt": "2026-01-26T04:10:54.758Z"
    },
    {
      "slug": "integrations/importing-and-exporting-your-data-with-nestr",
      "url": "https://help.nestr.io/en/integrations/importing-and-exporting-your-data-with-nestr",
      "title": "Importing and exporting your data with Nestr",
      "category": "integrations",
      "content": "Importing and exporting your data with Nestr Written by Joost Schouten Updated 10 months ago At nestr we believe you should be able to use the tools that best suits you. We try to make integrations and migrations as seamless as possible. Importing data into Nestr If you are using another tool for your self-organisation today we can import and sync the data from that tool into Nestr. This is a great way to try Nestr out using your actual data. Importing from Holaspirit or Glassfrog Once you have created a workspace you can navigate to the workspace settings. There you will find an integrations tab. There are integrations for both Holaspirit and Glassfrog you can enable. Enable your tool of choice and run the import as described in these help articles: Import your data into Nestr from Holaspirit Import your data into Nestr from Glassfrog Both these integrations will allow you to import pretty much all your data across. And you can simply run the sync again a few days/weeks later to update the data in Nestr. Import using the API If you know how to use an API, Nestr has a full-fledged API that will allow you to import and sync all your data. Importing from other tools If you currently use another tool or have your data stored in excel/sheets/csv. Please contact us and we'd be more than happy to import this data for you. Exporting data from Nestr Your data is always yours and you have full access to it at all times. Export to csv/excel Everything you see in Nestr you can directly export to csv/excel. The main search has an export button right in the search conrols. And most tabs offer an export button in the view controls. Export using the API If you know how to use an API, Nestr has a full-fledged API that will allow you to export and sync all your data. Did this answer your question? At nestr we believe you should be able to use the tools that best suits you. We try to make integrations and migrations as seamless as possible. Importing data into Nestr If you are using another tool for your self-organisation today we can import and sync the data from that tool into Nestr. This is a great way to try Nestr out using your actual data. Importing from Holaspirit or Glassfrog Once you have created a workspace you can navigate to the workspace settings. There you will find an integrations tab. There are integrations for both Holaspirit and Glassfrog you can enable. Enable your tool of choice and run the import as described in these help articles: Import your data into Nestr from Holaspirit Import your data into Nestr from Glassfrog Both these integrations will allow you to import pretty much all your data across. And you can simply run the sync again a few days/weeks later to update the data in Nestr. Import using the API If you know how to use an API, Nestr has a full-fledged API that will allow you to import and sync all your data. Importing from other tools If you currently use another tool or have your data stored in excel/sheets/csv. Please contact us and we'd be more than happy to import this data for you. Exporting data from Nestr Your data is always yours and you have full access to it at all times. Export to csv/excel Everything you see in Nestr you can directly export to csv/excel. The main search has an export button right in the search conrols. And most tabs offer an export button in the view controls. Export using the API If you know how to use an API, Nestr has a full-fledged API that will allow you to export and sync all your data.",
      "fetchedAt": "2026-01-26T04:10:55.638Z"
    },
    {
      "slug": "integrations/saml-authentication-for-nestr",
      "url": "https://help.nestr.io/en/integrations/saml-authentication-for-nestr",
      "title": "SAML authentication for Nestr",
      "category": "integrations",
      "content": "SAML authentication for Nestr Setup SAML authentication for your Nestr workspace Written by Joost Schouten Updated 1 year ago Note that though Nestr supports SAML, in most cases newer authentication methods like OAuth and OpenID allow most of the benefits of SAML, don't need any configuration to use and offer a more seamless user experience. SAML (Security Assertion Markup Language) is an authentication protocol to allow an organisation to centrally administer who within your organisation has access to what apps using an Identity Provider (IDP). If your organisation requires the use of SAML, here is how you can configure it. Configure your Identity Provider Depending on your Identity Provider (eg. Azure) there might be some small differences in how the different fields are named. You should find where you can configure Single-sign-on (SSO) and configure SAML to use the following fields. Identifier (Entity ID) https://app.nestr.io Reply URL (Assertion Consumer Service URL) - Replace the domain.com with your registered domain https://app.nestr.io/saml/consume/domain.com Under Attributes & Claims we please use the following setup. Claim name Value givenname user.givenname surname user.surname emailaddress user.mail Unique User Identifier user.mail Configure Nestr Navigate to your workspace settings and go to the \"Integrations\" tab. In your Identity Provider, find the correct values for the following fields and paste them into the configuration fields as shown above. Identity Provider Entity ID This is an ID specific to your app configuration within the Identity Provider. For Azure this looks something like: https://sts.windows.net/xx....xx/ Identity Provider SSO endpoint This is the login URL Nestr will point users to wanting to login to a workspace using SAML. For Azure this looks something like https://login.microsoftonline.com/xx....xx/saml2 Identity Signing Certificate This is a certificate used to ensure the login requests come from the correct IDP and you can download this from your IDP. Open it in a text editor and paste it into the field. It should start with -----BEGIN CERTIFICATE----- and end with -----END CERTIFICATE----- Finally, to make this setup work flawlessly, we recommend you to add all the email domains you use within your organisation. Navigate to \"User permissions\" and check \"Allow email users from certain domains to join this workspace\". There you can add all domains you control (we'll take you through a verification process) so that when people try to login with those email addresses, they will be redirected to your required SAML authentication. Did this answer your question? Note that though Nestr supports SAML, in most cases newer authentication methods like OAuth and OpenID allow most of the benefits of SAML, don't need any configuration to use and offer a more seamless user experience. SAML (Security Assertion Markup Language) is an authentication protocol to allow an organisation to centrally administer who within your organisation has access to what apps using an Identity Provider (IDP). If your organisation requires the use of SAML, here is how you can configure it. Configure your Identity Provider Depending on your Identity Provider (eg. Azure) there might be some small differences in how the different fields are named. You should find where you can configure Single-sign-on (SSO) and configure SAML to use the following fields. Identifier (Entity ID) https://app.nestr.io Reply URL (Assertion Consumer Service URL) - Replace the domain.com with your registered domain https://app.nestr.io/saml/consume/domain.com Under Attributes & Claims we please use the following setup. Claim name Value givenname user.givenname surname user.surname emailaddress user.mail Unique User Identifier user.mail Configure Nestr Navigate to your workspace settings and go to the \"Integrations\" tab. In your Identity Provider, find the correct values for the following fields and paste them into the configuration fields as shown above. Identity Provider Entity ID This is an ID specific to your app configuration within the Identity Provider. For Azure this looks something like: https://sts.windows.net/xx....xx/ Identity Provider SSO endpoint This is the login URL Nestr will point users to wanting to login to a workspace using SAML. For Azure this looks something like https://login.microsoftonline.com/xx....xx/saml2 Identity Signing Certificate This is a certificate used to ensure the login requests come from the correct IDP and you can download this from your IDP. Open it in a text editor and paste it into the field. It should start with -----BEGIN CERTIFICATE----- and end with -----END CERTIFICATE----- Finally, to make this setup work flawlessly, we recommend you to add all the email domains you use within your organisation. Navigate to \"User permissions\" and check \"Allow email users from certain domains to join this workspace\". There you can add all domains you control (we'll take you through a verification process) so that when people try to login with those email addresses, they will be redirected to your required SAML authentication.",
      "fetchedAt": "2026-01-26T04:10:56.502Z"
    },
    {
      "slug": "using-nestr/navigating-nestr",
      "url": "https://help.nestr.io/en/using-nestr/navigating-nestr",
      "title": "Navigating Nestr",
      "category": "using-nestr",
      "content": "Navigating Nestr How Nestr is setup and how you can navigate it Written by Joost Schouten Updated 1 year ago Nestr serves two goals Help people to assess if the work they do aligns with their personal values Help organisations deliver on the purpose they set out to achieve Your personal views The navigation on the left of the page is all about your personal overviews. It will show you all your workspaces, circles/roles, projects, todo's and feedback across all workspaces you are a member of. The circle view at the bottom shows you all the workspaces you are a member of in one overview. We call this your purpose fingerprint. If you click the arrows, you can maximise that view and use it to navigate your workspaces. On the top right under your profile picture (or your initials if you have not yet provided one) you can find your account settings. Workspace views A workspace can represent an organisation or could be a personal project you run for just yourself. Whatever it represents, once you click it you will only see information relevant to that workspace. Once you click on any of your worksapces, you will enter the workspace and see all relevant information for that workspace. In the below workspace you see these different parts: The maximised purpose fingerprint allowing you to navigate your workspace/organisation visually simply by clicking on the roles/circles The breadcrumbs showing you where you are in your workspace. Here showing you, you are looking at the Nestr.io GCC circle in the Nestr workspace. You can always click the different parts to navigate there. The main tabs related to the content you are viewing. In this case the Structure, Work and Communicate tabs of the Nestr.io GCC circle. The available sub-tabs. Here projects (selected)/todos/meetings/metrics/checklists/feedback as available under 'Work'. The content of the page. Here the project board for the Nestr.io GCC circle. All headers and cards can be clicked to open the specific projects. When you have minimised the circle view, and you click on anything, it will open in a detail view on the right. When a detail view is open, there are a couple of parts to the page The open and close buttons. The left button will open the detail full screen and the right button will close the detail view. The detail breadcrumbs show you how the detail relates to the main view. The breadcrumbs will be relative to the main view. The name of the item (circle/role/project/todo) you are viewing The actions related to the item you are viewing. The assigned people to the item you are viewing The optional fields related to the item you are viewing. Depending on what you are viewing, the content of the page might change. In this case you can add todos to the project being viewed. Comments and conversations related to the item you are viewing. Did this answer your question? Nestr serves two goals Help people to assess if the work they do aligns with their personal values Help organisations deliver on the purpose they set out to achieve Your personal views The navigation on the left of the page is all about your personal overviews. It will show you all your workspaces, circles/roles, projects, todo's and feedback across all workspaces you are a member of. The circle view at the bottom shows you all the workspaces you are a member of in one overview. We call this your purpose fingerprint. If you click the arrows, you can maximise that view and use it to navigate your workspaces. On the top right under your profile picture (or your initials if you have not yet provided one) you can find your account settings. Workspace views A workspace can represent an organisation or could be a personal project you run for just yourself. Whatever it represents, once you click it you will only see information relevant to that workspace. Once you click on any of your worksapces, you will enter the workspace and see all relevant information for that workspace. In the below workspace you see these different parts: The maximised purpose fingerprint allowing you to navigate your workspace/organisation visually simply by clicking on the roles/circles The breadcrumbs showing you where you are in your workspace. Here showing you, you are looking at the Nestr.io GCC circle in the Nestr workspace. You can always click the different parts to navigate there. The main tabs related to the content you are viewing. In this case the Structure, Work and Communicate tabs of the Nestr.io GCC circle. The available sub-tabs. Here projects (selected)/todos/meetings/metrics/checklists/feedback as available under 'Work'. The content of the page. Here the project board for the Nestr.io GCC circle. All headers and cards can be clicked to open the specific projects. When you have minimised the circle view, and you click on anything, it will open in a detail view on the right. When a detail view is open, there are a couple of parts to the page The open and close buttons. The left button will open the detail full screen and the right button will close the detail view. The detail breadcrumbs show you how the detail relates to the main view. The breadcrumbs will be relative to the main view. The name of the item (circle/role/project/todo) you are viewing The actions related to the item you are viewing. The assigned people to the item you are viewing The optional fields related to the item you are viewing. Depending on what you are viewing, the content of the page might change. In this case you can add todos to the project being viewed. Comments and conversations related to the item you are viewing.",
      "fetchedAt": "2026-01-26T04:10:57.551Z"
    },
    {
      "slug": "using-nestr/nestr-the-basic-building-blocks",
      "url": "https://help.nestr.io/en/using-nestr/nestr-the-basic-building-blocks",
      "title": "Nestr - the basic building blocks",
      "category": "using-nestr",
      "content": "Nestr - the basic building blocks Here we'll explain the building blocks and tools that make up Nestr. Written by Joost Schouten Updated 2 years ago Disclaimer: This article is not a how-to but lays out the design patterns we use which helps when you want to get the most out of Nestr. Nest Almost everything you see in Nestr is actually a Nest. A Nest is the base building block. It has a name, a purpose and can contain other Nests inside of it. This is how you can structure pretty much any collaboration or project. Nests can present themselves as a Project, a Todo, a Role, a Circle, an entire organisation or pretty much anything you can think up. Workspace A workspace is actually just a Nest like any other. The only difference is that it is not contained in another one. It is the starting point of the structure it represents. This can be an organisation, company or a community in the case of a collaboration. It can also represent a project or life area for you to organise for just yourself. Label Labels are what makes Nestr come alive. By assigning a label to a Nest we give it meaning. Simply by assigning the appropriate label a Nest becomes a role, circle or project. There are many pre-defined labels available to use like the ones above. You can also create new ones. You can actually create two types of labels. Personal and workspace labels. Simply type #any_new_label_name in the name/purpose/description field of any Nest and we'll ask you if you want to create a new personal or workspace label. Personal labels are just for you and no one else will see them, even if they share a workspace with you. Workspace labels are available to everyone in that workspace. Once create and assigned you can search and create views based on all labels available to you. Search The search in Nestr is very powerful. You can simply type any text in the search and find any nest you have access to that uses that text in its name, description or purpose. You may also extend the search to only find nests that have a certain person assigned by typing @name of person. Or by typing #name of label to search for a nest with a certain label. This all get's very powerful when you combine a few of these options into one search query. To illustrate this, here is a search query that shows you all your projects across all your workspaces viewed on a project board assignee:me label:project groupbycol:project->status groupby:workspace Any search query you do can be saved by clicking the save icon on the search bar adding i to your navigation on the left for quick access later. You can find a full list of the available search options here. If there is a certain view or search you are trying to create, get in touch and we're happy to help. Most likely it is already possible and we can set this up for you. Hopefully this will give you a basic idea on how Nestr is setup and what you can do with it. We'll dive into the details of these building blocks in more detail in other articles. Did this answer your question? Disclaimer: This article is not a how-to but lays out the design patterns we use which helps when you want to get the most out of Nestr. Nest Almost everything you see in Nestr is actually a Nest. A Nest is the base building block. It has a name, a purpose and can contain other Nests inside of it. This is how you can structure pretty much any collaboration or project. Nests can present themselves as a Project, a Todo, a Role, a Circle, an entire organisation or pretty much anything you can think up. Workspace A workspace is actually just a Nest like any other. The only difference is that it is not contained in another one. It is the starting point of the structure it represents. This can be an organisation, company or a community in the case of a collaboration. It can also represent a project or life area for you to organise for just yourself. Label Labels are what makes Nestr come alive. By assigning a label to a Nest we give it meaning. Simply by assigning the appropriate label a Nest becomes a role, circle or project. There are many pre-defined labels available to use like the ones above. You can also create new ones. You can actually create two types of labels. Personal and workspace labels. Simply type #any_new_label_name in the name/purpose/description field of any Nest and we'll ask you if you want to create a new personal or workspace label. Personal labels are just for you and no one else will see them, even if they share a workspace with you. Workspace labels are available to everyone in that workspace. Once create and assigned you can search and create views based on all labels available to you. Search The search in Nestr is very powerful. You can simply type any text in the search and find any nest you have access to that uses that text in its name, description or purpose. You may also extend the search to only find nests that have a certain person assigned by typing @name of person. Or by typing #name of label to search for a nest with a certain label. This all get's very powerful when you combine a few of these options into one search query. To illustrate this, here is a search query that shows you all your projects across all your workspaces viewed on a project board assignee:me label:project groupbycol:project->status groupby:workspace Any search query you do can be saved by clicking the save icon on the search bar adding i to your navigation on the left for quick access later. You can find a full list of the available search options here. If there is a certain view or search you are trying to create, get in touch and we're happy to help. Most likely it is already possible and we can set this up for you. Hopefully this will give you a basic idea on how Nestr is setup and what you can do with it. We'll dive into the details of these building blocks in more detail in other articles.",
      "fetchedAt": "2026-01-26T04:10:58.411Z"
    },
    {
      "slug": "integrations/importing-data-from-holaspirit",
      "url": "https://help.nestr.io/en/integrations/importing-data-from-holaspirit",
      "title": "Importing Data from Holaspirit",
      "category": "integrations",
      "content": "Importing Data from Holaspirit Import your data from Holaspirit into Nestr Written by Julio Holon Updated 10 months ago Nestr can import data from Holaspirit. Simply go to your workspace or create a new one. After you created the workspace, head into it and navigate to the workspace settings page:Once there, navigate to the 'Integrations' tab and enable the Holaspirit integration. In there you have to fill the Holaspirit API key and Holaspirit Org ID. In order to get your API key you will need to contact Holaspirit support (it's only available on the Scale plan and up) Please include the \"api:\" part of the given string. To get your Holaspirit Org ID, you have to login into Holaspirit and copy the URL where you connect, to extract the ID, something like: https://app.holaspirit.com/o/xxxxxxxxxxxxxxxxxxxxxxxx/ Copy the number and letters from the URL, after \"/o/\" and before the final slash. After you have copied this into Workspace details, you can choose options before starting the import: Import users from Holaspirit: this defines if you want to also import Holaspirit users and attributions into Nestr, but this will not actually invite the users. Invite imported users to Nestr: this will actually send an email invitation to these users to start using Nestr. Once you click Synchronize, you will see the the importing steps going one by one. It could take some time for larger organizations. You can re-run the import by clicking the Synchronize button whenever anything change on Holaspirit. Did this answer your question? Nestr can import data from Holaspirit. Simply go to your workspace or create a new one. After you created the workspace, head into it and navigate to the workspace settings page:Once there, navigate to the 'Integrations' tab and enable the Holaspirit integration. In there you have to fill the Holaspirit API key and Holaspirit Org ID. In order to get your API key you will need to contact Holaspirit support (it's only available on the Scale plan and up) Please include the \"api:\" part of the given string. To get your Holaspirit Org ID, you have to login into Holaspirit and copy the URL where you connect, to extract the ID, something like: https://app.holaspirit.com/o/xxxxxxxxxxxxxxxxxxxxxxxx/ Copy the number and letters from the URL, after \"/o/\" and before the final slash. After you have copied this into Workspace details, you can choose options before starting the import: Import users from Holaspirit: this defines if you want to also import Holaspirit users and attributions into Nestr, but this will not actually invite the users. Invite imported users to Nestr: this will actually send an email invitation to these users to start using Nestr. Once you click Synchronize, you will see the the importing steps going one by one. It could take some time for larger organizations. You can re-run the import by clicking the Synchronize button whenever anything change on Holaspirit.",
      "fetchedAt": "2026-01-26T04:10:59.271Z"
    },
    {
      "slug": "integrations/importing-data-from-glassfrog",
      "url": "https://help.nestr.io/en/integrations/importing-data-from-glassfrog",
      "title": "Importing Data from Glassfrog",
      "category": "integrations",
      "content": "Importing Data from Glassfrog Import your Glassfrog data into Nestr Written by Julio Holon Updated 10 months ago Nestr can import your data from Glassfrog. It will import pretty much everything straight into your Nestr account. In order to use that feature, you may want to start by creating a new Workspace, clicking the [+Create] button on \"My Workspaces\". After you create the workspace, head into it and navigate to the workspace settings page. Once there, navigate to the 'Integrations' tab and enable the Glassfrog integration. In there you have to fill the Glassfrog API key. You can create an API key in your Glassfrog account when you go into your organisation and go to \"Your profile and settings\" page and navigate to the \"API\" tab. There tou can create a new API key. Do this and copy it across into the the \"Glassfrog API key\" field in Nestr. Check the box if you want to import users, if you would like to invite them directly into Nestr and hit the \"Synchronise\" button. Depending on the size of your account this can take a few seconds to up to an hour. You can simply let it run in the background and see the circles and roles appear as they come in. If you wish to update the latest changes from your Glassfrog account into Nestr, simply click the \"Synchronize\" button again and we'll import the changes for you. Happy Nestring! Did this answer your question? Nestr can import your data from Glassfrog. It will import pretty much everything straight into your Nestr account. In order to use that feature, you may want to start by creating a new Workspace, clicking the [+Create] button on \"My Workspaces\". After you create the workspace, head into it and navigate to the workspace settings page. Once there, navigate to the 'Integrations' tab and enable the Glassfrog integration. In there you have to fill the Glassfrog API key. You can create an API key in your Glassfrog account when you go into your organisation and go to \"Your profile and settings\" page and navigate to the \"API\" tab. There tou can create a new API key. Do this and copy it across into the the \"Glassfrog API key\" field in Nestr. Check the box if you want to import users, if you would like to invite them directly into Nestr and hit the \"Synchronise\" button. Depending on the size of your account this can take a few seconds to up to an hour. You can simply let it run in the background and see the circles and roles appear as they come in. If you wish to update the latest changes from your Glassfrog account into Nestr, simply click the \"Synchronize\" button again and we'll import the changes for you. Happy Nestring!",
      "fetchedAt": "2026-01-26T04:11:00.131Z"
    },
    {
      "slug": "using-nestr/nestr-search",
      "url": "https://help.nestr.io/en/using-nestr/nestr-search",
      "title": "Nestr search",
      "category": "using-nestr",
      "content": "Nestr search How to search and find things in Nestr Written by Joost Schouten Updated 1 year ago Nestr's search function is very powerful and is available whenever you use Nestr. Searching A search query can consist of a simple word or can be made up of a combination of many different parts. Here we lay out all the options available to you. Text search You can simply type anything you want and it will find any relevant matches. Nestr will match on the name, purpose or description of anything you have access to. So it will return any found users, projects, roles, circles, accountabilities, to-dos and notes. Click any of the results and they will open for you right there next to your search results. Search tools At the top of the search results you have a few tools to your disposal to help you quickly find what you are after. Structure: Click on structure to limit the search results to only show you roles, circles, accountabilities, domains or policies. Projects: Click on projects to limit the search results to only show you projects. Todos: Click on Todos to limit the search results to only show you todos. People: Click on People to limit the search results to only show you people. Filters Click the filter icon to filter the search results on users and/or labels. This will allow you to zero in on the results you are after. Group The last search tool in the search toolsbar is the group option. Here you can select if you want your results to be grouped by assignee, workspace or no grouping. Advanced search options Besides using the search tools you can also use the autocomplete advanced search options available. Label search If you type label: or #, nestr will recognise you want to add a label search to your query and present you with a drop down of all the labels available to search with. Keep typing and we'll narrow the available options in the drop down and/or select the label you want. You can also search for multiple labels. If, for example, you type label:bug,project, we'll show all matches with the label bug OR the label project. If you use label:bug label:project we'll return all matches with the label bug AND the label project. If you want to exclude all matches with a certain label. You can add label:!project and we'll remove all matches with the project label from the results. Assignee searches When you type assignee: or @ Nestr recognises you wish to limit your search results to only include those assigned to a certain person. If you use assignee:joost assignee:oli we'll return all matches with Joost assigned OR Oli assigned. If you want to exclude all matches with a certain assignee. You can add assignee:!joost and we'll remove all matches assigned to Joost from the results. Attribute searches Nestr allows you to further refine your searches by using the has: operator. This allows you to limit your search results in five different ways: due - Only show results that have a due date. children - Only show results that have children. (eg. a project that has sub-projects or to-dos assigned) completable - Only return results that can be completed, like a project or a to-do. This will exclude things like roles, circles and notes. commentable - Only return results that you can leave comments on. incompletechildren - This one seems a little obscure but is quite powerful. For example, you can find all your projects that have no next actions defined so that you can translate these projects into next actions you can start executing. Search results Nestr allows you to format the results you get from your searches in a couple of powerful ways. Sort By using sort: you can instruct nestr to sort the results. There are six ways to sort. Title - This orders the results alphabetically based on the name or the project/role/circle/etc. Search order - Order the results on their given order. This is the order you the user give any result by dragging it up or down in the search results. Due date - Order the results based on their due date. Created time - Order the results based on when they are created. Last updated time - Order the results based on when they were last updated. Parent nest order - Order the results based on the order you give them under their parent. Foe example, when you add to-dos under a project in a certain order, we'll use that order when you choose this option. You can also add the optional sort-order: option. When omitted the default value is asc (ascending) will be used. If you choose desc (descending) the sort order will be inverted. Group by By adding groupby: to your search Nestr will group your results in groups of your choosing. The options you can group by are: label - This will group your results by the first label found in the matched results. (eg. this example will show you all your to-dos grouped by label) parent - This will group the results by the parent of the found results. (eg. this example will group all found roles by their parent circle) workspace - This will group the results by the workspace they are a part of. (eg. this example will show you all your projects grouped by workspace) assignee - This will group the results by assignee. (eg. this example will group all roles by their assignee) completed - This will group results based on their completed status. Note that this will exclude any results that are not completable (eg. a role or circle) and only works if you turn off the 'hide completed' filter on the top right of your screen. (eg. this example will show me all my projects grouped by completed) due - This will group your results by their due date in groups: overdue, today, this week, next week and later. Note that this will exclude any results that do not have a due date assigned. (eg. this example shows you all your results with a due date grouped by their due date) project->status - This option is not in the auto suggest but does work. It will group your results on the state field value of your projects. Group by columns Just like the groupby above, you can add a groupbycol: with the same options as groupby. The only difference is that rather than groups, nestr creates columns. It works exactly the same except that the representation is different. And you can even combine the groupby and groupbycol. Here is an example where we show all projects with a column for each assignee. Saved searches All searches you do you can save. Right next to the search a little save icon shows up. When you click it you get a prompt that allows you to name the search and add it to a group. This group will be added to your navigation with your search in it for easy access. Happy searching! Did this answer your question? Nestr's search function is very powerful and is available whenever you use Nestr. Searching A search query can consist of a simple word or can be made up of a combination of many different parts. Here we lay out all the options available to you. Text search You can simply type anything you want and it will find any relevant matches. Nestr will match on the name, purpose or description of anything you have access to. So it will return any found users, projects, roles, circles, accountabilities, to-dos and notes. Click any of the results and they will open for you right there next to your search results. Search tools At the top of the search results you have a few tools to your disposal to help you quickly find what you are after. Structure: Click on structure to limit the search results to only show you roles, circles, accountabilities, domains or policies. Projects: Click on projects to limit the search results to only show you projects. Todos: Click on Todos to limit the search results to only show you todos. People: Click on People to limit the search results to only show you people. Filters Click the filter icon to filter the search results on users and/or labels. This will allow you to zero in on the results you are after. Group The last search tool in the search toolsbar is the group option. Here you can select if you want your results to be grouped by assignee, workspace or no grouping. Advanced search options Besides using the search tools you can also use the autocomplete advanced search options available. Label search If you type label: or #, nestr will recognise you want to add a label search to your query and present you with a drop down of all the labels available to search with. Keep typing and we'll narrow the available options in the drop down and/or select the label you want. You can also search for multiple labels. If, for example, you type label:bug,project, we'll show all matches with the label bug OR the label project. If you use label:bug label:project we'll return all matches with the label bug AND the label project. If you want to exclude all matches with a certain label. You can add label:!project and we'll remove all matches with the project label from the results. Assignee searches When you type assignee: or @ Nestr recognises you wish to limit your search results to only include those assigned to a certain person. If you use assignee:joost assignee:oli we'll return all matches with Joost assigned OR Oli assigned. If you want to exclude all matches with a certain assignee. You can add assignee:!joost and we'll remove all matches assigned to Joost from the results. Attribute searches Nestr allows you to further refine your searches by using the has: operator. This allows you to limit your search results in five different ways: due - Only show results that have a due date. children - Only show results that have children. (eg. a project that has sub-projects or to-dos assigned) completable - Only return results that can be completed, like a project or a to-do. This will exclude things like roles, circles and notes. commentable - Only return results that you can leave comments on. incompletechildren - This one seems a little obscure but is quite powerful. For example, you can find all your projects that have no next actions defined so that you can translate these projects into next actions you can start executing. Search results Nestr allows you to format the results you get from your searches in a couple of powerful ways. Sort By using sort: you can instruct nestr to sort the results. There are six ways to sort. Title - This orders the results alphabetically based on the name or the project/role/circle/etc. Search order - Order the results on their given order. This is the order you the user give any result by dragging it up or down in the search results. Due date - Order the results based on their due date. Created time - Order the results based on when they are created. Last updated time - Order the results based on when they were last updated. Parent nest order - Order the results based on the order you give them under their parent. Foe example, when you add to-dos under a project in a certain order, we'll use that order when you choose this option. You can also add the optional sort-order: option. When omitted the default value is asc (ascending) will be used. If you choose desc (descending) the sort order will be inverted. Group by By adding groupby: to your search Nestr will group your results in groups of your choosing. The options you can group by are: label - This will group your results by the first label found in the matched results. (eg. this example will show you all your to-dos grouped by label) parent - This will group the results by the parent of the found results. (eg. this example will group all found roles by their parent circle) workspace - This will group the results by the workspace they are a part of. (eg. this example will show you all your projects grouped by workspace) assignee - This will group the results by assignee. (eg. this example will group all roles by their assignee) completed - This will group results based on their completed status. Note that this will exclude any results that are not completable (eg. a role or circle) and only works if you turn off the 'hide completed' filter on the top right of your screen. (eg. this example will show me all my projects grouped by completed) due - This will group your results by their due date in groups: overdue, today, this week, next week and later. Note that this will exclude any results that do not have a due date assigned. (eg. this example shows you all your results with a due date grouped by their due date) project->status - This option is not in the auto suggest but does work. It will group your results on the state field value of your projects. Group by columns Just like the groupby above, you can add a groupbycol: with the same options as groupby. The only difference is that rather than groups, nestr creates columns. It works exactly the same except that the representation is different. And you can even combine the groupby and groupbycol. Here is an example where we show all projects with a column for each assignee. Saved searches All searches you do you can save. Right next to the search a little save icon shows up. When you click it you get a prompt that allows you to name the search and add it to a group. This group will be added to your navigation with your search in it for easy access. Happy searching!",
      "fetchedAt": "2026-01-26T04:11:01.024Z"
    },
    {
      "slug": "using-nestr/using-nestr",
      "url": "https://help.nestr.io/en/using-nestr/using-nestr",
      "title": "Using Nestr - a quick overview",
      "category": "using-nestr",
      "content": "Using Nestr - a quick overview Let us run you through the basic functionalities of Nestr Written by Joost Schouten Updated 1 year ago This article does not intent to be a comprehensive deep-dive into Nestr, rather a quick introduction to get you started. Navigating Nestr Let me guide you through the different ways to navigate in Nestr. Creating projects & todo's Here I show how you can create projects and todo's and where you can find them Starting a circle/tactical meeting How to to start a circle/tactical meeting and run through the different steps. Proposing a structure/governance change If you'd like to suggest a change to a role, circle or policy, you can simply create an agenda item and propose it. Please don't hesitate to reach out if you have more in depth questions. We're here to assist. Did this answer your question? This article does not intent to be a comprehensive deep-dive into Nestr, rather a quick introduction to get you started. Navigating Nestr Let me guide you through the different ways to navigate in Nestr. Creating projects & todo's Here I show how you can create projects and todo's and where you can find them Starting a circle/tactical meeting How to to start a circle/tactical meeting and run through the different steps. Proposing a structure/governance change If you'd like to suggest a change to a role, circle or policy, you can simply create an agenda item and propose it. Please don't hesitate to reach out if you have more in depth questions. We're here to assist.",
      "fetchedAt": "2026-01-26T04:11:01.884Z"
    },
    {
      "slug": "using-nestr/chat-channels-and-communication-in-nestr",
      "url": "https://help.nestr.io/en/using-nestr/chat-channels-and-communication-in-nestr",
      "title": "Chat & channels - communication in Nestr",
      "category": "using-nestr",
      "content": "Chat & channels - communication in Nestr Circle based communication and private messaging in Nestr. Written by Joost Schouten Updated 1 year ago With Nestr we aim to support you and your organisation to get razor focussed on the work that is most likely to make the biggest impact towards achieving your collective purpose. To do this, focus is important. That is why we believe your communication tools need to help you filtering out all the noise that is not serving you. Circle based feed Circle based channels can help you achieve this. If your workspace has the feeds app enabled, each circle will have their own feed where you can configure channels important to you and your collegues without being bombarded by channels and conversations from other teams and circles that are irrelevant for your work. You can always have a look at the feed of other circles if that serves you of course. Below you can see an example of a circle feed. You can see the different channels, including the selected 'all' channel and the ongoing conversations. The 'All' channel will also show any conversations that are happening inside projects within the circle so that nothing is missed. Direct messaging At the right bottom of your page you will always see your direct messaging tab. Click it to open a list of your private message conversations. The messages shared there are always private where the messages in the feed as outlined above are always public. If you have no message history yet, simply search for your collegue and start your conversation. They will get a notification that you have reached out to them. Did this answer your question? With Nestr we aim to support you and your organisation to get razor focussed on the work that is most likely to make the biggest impact towards achieving your collective purpose. To do this, focus is important. That is why we believe your communication tools need to help you filtering out all the noise that is not serving you. Circle based feed Circle based channels can help you achieve this. If your workspace has the feeds app enabled, each circle will have their own feed where you can configure channels important to you and your collegues without being bombarded by channels and conversations from other teams and circles that are irrelevant for your work. You can always have a look at the feed of other circles if that serves you of course. Below you can see an example of a circle feed. You can see the different channels, including the selected 'all' channel and the ongoing conversations. The 'All' channel will also show any conversations that are happening inside projects within the circle so that nothing is missed. Direct messaging At the right bottom of your page you will always see your direct messaging tab. Click it to open a list of your private message conversations. The messages shared there are always private where the messages in the feed as outlined above are always public. If you have no message history yet, simply search for your collegue and start your conversation. They will get a notification that you have reached out to them.",
      "fetchedAt": "2026-01-26T04:11:02.751Z"
    },
    {
      "slug": "using-nestr/getting-started-with-nestr",
      "url": "https://help.nestr.io/en/using-nestr/getting-started-with-nestr",
      "title": "Getting started with Nestr",
      "category": "using-nestr",
      "content": "Getting started with Nestr What is Nestr all about and how to get started Written by Joost Schouten Updated 1 year ago Many people starting with Nestr will also be somewhere on the journey of mastering self-organisation and role based work. Our aim is for Nestr to both help you in your journey to master the practice of self-organisation as well as offer a simple and easy way to onboard you onto the product itself. To help you on your way, we have created a two landing pages aimed at different audiences. Please choose one that is appropriate for you. I am setting up Nestr for my organisation I have been invited by a colleague into Nestr. Also, feel free to use the help search at the top of the page or to click around through our help docs yourself. Happy Nesting, Joost Did this answer your question? Many people starting with Nestr will also be somewhere on the journey of mastering self-organisation and role based work. Our aim is for Nestr to both help you in your journey to master the practice of self-organisation as well as offer a simple and easy way to onboard you onto the product itself. To help you on your way, we have created a two landing pages aimed at different audiences. Please choose one that is appropriate for you. I am setting up Nestr for my organisation I have been invited by a colleague into Nestr. Also, feel free to use the help search at the top of the page or to click around through our help docs yourself. Happy Nesting, Joost",
      "fetchedAt": "2026-01-26T04:11:03.632Z"
    },
    {
      "slug": "integrations/using-the-nestr-api",
      "url": "https://help.nestr.io/en/integrations/using-the-nestr-api",
      "title": "Using the Nestr API",
      "category": "integrations",
      "content": "Using the Nestr API For developers: A technical description on how to integrate with Nestr using our API Written by Joost Schouten Updated 1 year ago Generate a Nestr API key The Nestr api allows manipulation of nests from outside the Nestr application. The api can be used to create an integration with other applications, or to easily add nests from anywhere. To get started, go to your workspace settings where you'll find a tab \"Integrations\" There you'll find the \"Workspace API access\" integration. Click in \"configure\" and create a new API key. You can optionally name the API key and give a description. If you have multiple integrations, it pays to setup a key for each one and name them accordingly. For example one key for your \"CRM integration\" and other for your \"Slack integration\". Once you named your API key, click \"Create API key\". This will generate and store the key for you. We will only show you the key once, so make sure you copy it and store it securely in a password manager. If you loose this key, invalidate it immediately as anyone with the key has full access to your workspace. Never email or share the key. If others in your organisation need access, let them create their own keys. Use your Nestr API key Disclaimer: To use the API key, you either need to understand how using an API works or you should use it in another tool that will integrate with Nestr. The Nestr API key is a Bearer token and will need to be presented to Nestr using the Authorization header like so: \"Authorization: Bearer YOUR_NESTR_API_KEY\". The following command should return you information about the workspace you created the API key for curl -X GET \"https://app.nestr.io/api/workspaces\" \\-H \"Authorization: Bearer YOUR_NESTR_API_KEY\" \\-H \"Content-Type: application/json\" Nestr API documentation You can find up to date documentation on all our API endpoints on our API documentation page. Did this answer your question? Generate a Nestr API key The Nestr api allows manipulation of nests from outside the Nestr application. The api can be used to create an integration with other applications, or to easily add nests from anywhere. To get started, go to your workspace settings where you'll find a tab \"Integrations\" There you'll find the \"Workspace API access\" integration. Click in \"configure\" and create a new API key. You can optionally name the API key and give a description. If you have multiple integrations, it pays to setup a key for each one and name them accordingly. For example one key for your \"CRM integration\" and other for your \"Slack integration\". Once you named your API key, click \"Create API key\". This will generate and store the key for you. We will only show you the key once, so make sure you copy it and store it securely in a password manager. If you loose this key, invalidate it immediately as anyone with the key has full access to your workspace. Never email or share the key. If others in your organisation need access, let them create their own keys. Use your Nestr API key Disclaimer: To use the API key, you either need to understand how using an API works or you should use it in another tool that will integrate with Nestr. The Nestr API key is a Bearer token and will need to be presented to Nestr using the Authorization header like so: \"Authorization: Bearer YOUR_NESTR_API_KEY\". The following command should return you information about the workspace you created the API key for curl -X GET \"https://app.nestr.io/api/workspaces\" \\-H \"Authorization: Bearer YOUR_NESTR_API_KEY\" \\-H \"Content-Type: application/json\" Nestr API documentation You can find up to date documentation on all our API endpoints on our API documentation page.",
      "fetchedAt": "2026-01-26T04:11:04.501Z"
    },
    {
      "slug": "using-nestr/nestr-the-power-of-labels",
      "url": "https://help.nestr.io/en/using-nestr/nestr-the-power-of-labels",
      "title": "Nestr - The power of labels",
      "category": "using-nestr",
      "content": "Nestr - The power of labels What are labels and how to use them Written by Joost Schouten Updated 1 year ago You can customise Nestr to suit your needs in many different ways and Labels are at the center of this. You can add a label simply by typing #name_of_label in the name, description or purpose field of any Nest (role/circle/project...) you interact with. If the label does not exist yet, you can create it right there and then. You can also add labels anywhere you see the three dots. As you can see, you can create a personal or workspace label. There are actually three types of labels. Three types of Labels In Nestr you can add labels to almost everything and there are three types of labels: System labels: These are labels Nestr offers out of the box (eg. #project) Workspace labels: These are labels you can create and use within a certain workspace. User labels: These are personal labels you can use across all workspaces you have access to and will only be visible to you, even in your shared workspaces. Labels to categorise your work & organisation You can use labels in a few different ways. The can help you categorise and organise your work and organisation. Once assigned, you can easily search for any project/circle/role/etc. with your label by typing #your_label in the search field. Also, almost all pages offer a way to filter on used labels. So your circle or role project board allows you to filter on certain labels so you can create focus. This is great for running a sprint where you label your sprint work with the label 'sprint_3' and filter on just that label for the duration of your sprint. Labels to customize Nestr Labels also allow you to customise how Nestr works. If you go to your workspace settings you'll see a \"Labels & Fields\" tab where you can create and edit all workspace labels and some system labels. If you click on any of the workspace labels you can edit the label name, color and add fields as well. Any field you define here will be added to all projects, roles, circles, etc. you have added this label to. This gets really powerful and you can add as many fields as you would like. At current you can add text, multiline text, number, currency, select, percentage and slider fields. Then whenever you use a label, the fields will automatically get added to what you have added the label to. Here is an example of a 'Story' label where we added a story points and a traffic light field. Note that the values of the fields show up in both the detail view as well as the list view. Extending system labels On top of adding fields to your own workspace labels, you can also change or add fields to some system labels. At current, you can update roles, circles and projects. If you add a field to any of them, they will show up throughout your workspace. you may also change the project status field and change the available options. This will in effect change the columns on your circle and role project boards as well. Here is a screenshot of a circle project board using custom columns. We look forward to seeing how you will be using the power of labels in your workspace. Happy Nesting! Did this answer your question? You can customise Nestr to suit your needs in many different ways and Labels are at the center of this. You can add a label simply by typing #name_of_label in the name, description or purpose field of any Nest (role/circle/project...) you interact with. If the label does not exist yet, you can create it right there and then. You can also add labels anywhere you see the three dots. As you can see, you can create a personal or workspace label. There are actually three types of labels. Three types of Labels In Nestr you can add labels to almost everything and there are three types of labels: System labels: These are labels Nestr offers out of the box (eg. #project) Workspace labels: These are labels you can create and use within a certain workspace. User labels: These are personal labels you can use across all workspaces you have access to and will only be visible to you, even in your shared workspaces. Labels to categorise your work & organisation You can use labels in a few different ways. The can help you categorise and organise your work and organisation. Once assigned, you can easily search for any project/circle/role/etc. with your label by typing #your_label in the search field. Also, almost all pages offer a way to filter on used labels. So your circle or role project board allows you to filter on certain labels so you can create focus. This is great for running a sprint where you label your sprint work with the label 'sprint_3' and filter on just that label for the duration of your sprint. Labels to customize Nestr Labels also allow you to customise how Nestr works. If you go to your workspace settings you'll see a \"Labels & Fields\" tab where you can create and edit all workspace labels and some system labels. If you click on any of the workspace labels you can edit the label name, color and add fields as well. Any field you define here will be added to all projects, roles, circles, etc. you have added this label to. This gets really powerful and you can add as many fields as you would like. At current you can add text, multiline text, number, currency, select, percentage and slider fields. Then whenever you use a label, the fields will automatically get added to what you have added the label to. Here is an example of a 'Story' label where we added a story points and a traffic light field. Note that the values of the fields show up in both the detail view as well as the list view. Extending system labels On top of adding fields to your own workspace labels, you can also change or add fields to some system labels. At current, you can update roles, circles and projects. If you add a field to any of them, they will show up throughout your workspace. you may also change the project status field and change the available options. This will in effect change the columns on your circle and role project boards as well. Here is a screenshot of a circle project board using custom columns. We look forward to seeing how you will be using the power of labels in your workspace. Happy Nesting!",
      "fetchedAt": "2026-01-26T04:11:05.397Z"
    },
    {
      "slug": "using-nestr/invited-into-a-collaborative-workspace-how-to-get-started",
      "url": "https://help.nestr.io/en/using-nestr/invited-into-a-collaborative-workspace-how-to-get-started",
      "title": "Invited into a collaborative workspace? How to get started.",
      "category": "using-nestr",
      "content": "Invited into a collaborative workspace? How to get started. You have been invited into Nestr by a colleague or friend. Let us run you through what Nestr is and how you can use it. Written by Joost Schouten Updated 1 year ago Nestr is a tool to help organisations get purpose driven work done using self-organisation and/or role based work. This page is intended as a list of the most important help documents to quickly get you on your way. The basics Navigating Nestr - Understanding the different elements in Nestr Structure/Governance - Creating and updating your shared agreements Work - Self-organised collaboration with your peers Communicate - Communicating with your peers using Nestr Search - Search for and finding things in Nestr Did this answer your question? Nestr is a tool to help organisations get purpose driven work done using self-organisation and/or role based work. This page is intended as a list of the most important help documents to quickly get you on your way. The basics Navigating Nestr - Understanding the different elements in Nestr Structure/Governance - Creating and updating your shared agreements Work - Self-organised collaboration with your peers Communicate - Communicating with your peers using Nestr Search - Search for and finding things in Nestr",
      "fetchedAt": "2026-01-26T04:11:06.264Z"
    },
    {
      "slug": "integrations/nestr-discord-integration",
      "url": "https://help.nestr.io/en/integrations/nestr-discord-integration",
      "title": "Nestr Discord integration",
      "category": "integrations",
      "content": "Nestr Discord integration How to use Nestr from Discord Written by Julio Holon Updated 2 years ago Discord is a popular community communication tool, that supports channels, voice, video and Bots! Since many of our Nestr users also use Discord we created a Discord Bot to link both tools. To invite the Nestr Bot to your server use this link. After inviting the bot, the second step to make the bot work is creating a Webhook. This is used for Nestr to be able to send asynchronous messages back to the bot (like notifications). Here's how you do it: Create a private channel called something like #bot-responses, give the bot user access to that channel (more help here: discord channels support) Go to Server Settings -> Integrations -> Webhooks Create a new Webhook and name it \"Nestr\" (it should look like below)(you don't need to copy the Webhook URL, the bot will find it automatically, by name) After the bot is on your Discord server, you will have access to the following bot commands: - /login connects your Discord and Nestr accounts - /sync and /unsync (as admin) will map a Nestr workspace to Discord, creating one channel per subcircle and mapping Nestr Roles to Discord roles, you will also start receiving Nestr notifications on Discord, about changes on Nestr and new meetings starting. - /accountable <TEXT>Searches for a text string, getting all roles accountable for that text string. - /roles [@person]Searches for all the roles for yourself or some @person. - /todos [@person] [@role]Searches for all todo items for yourself, some @person or @role. - /projects [@person] [@role]Searches for all projects for yourself, some @person or @role - /inbox <TEXT>Allows you to add a todo to yourself on your Nestr inbox Hopefully this will be helpful to our Discord loving communities. Did this answer your question? Discord is a popular community communication tool, that supports channels, voice, video and Bots! Since many of our Nestr users also use Discord we created a Discord Bot to link both tools. To invite the Nestr Bot to your server use this link. After inviting the bot, the second step to make the bot work is creating a Webhook. This is used for Nestr to be able to send asynchronous messages back to the bot (like notifications). Here's how you do it: Create a private channel called something like #bot-responses, give the bot user access to that channel (more help here: discord channels support) Go to Server Settings -> Integrations -> Webhooks Create a new Webhook and name it \"Nestr\" (it should look like below)(you don't need to copy the Webhook URL, the bot will find it automatically, by name) After the bot is on your Discord server, you will have access to the following bot commands: - /login connects your Discord and Nestr accounts - /sync and /unsync (as admin) will map a Nestr workspace to Discord, creating one channel per subcircle and mapping Nestr Roles to Discord roles, you will also start receiving Nestr notifications on Discord, about changes on Nestr and new meetings starting. - /accountable <TEXT>Searches for a text string, getting all roles accountable for that text string. - /roles [@person]Searches for all the roles for yourself or some @person. - /todos [@person] [@role]Searches for all todo items for yourself, some @person or @role. - /projects [@person] [@role]Searches for all projects for yourself, some @person or @role - /inbox <TEXT>Allows you to add a todo to yourself on your Nestr inbox Hopefully this will be helpful to our Discord loving communities.",
      "fetchedAt": "2026-01-26T04:11:07.209Z"
    }
  ]
}